# NumberOfCoordinates Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine..::..NumberOfCoordinates Property
PolyLine Class See Also
---
Gets the number of the coordinate points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfCoordinates { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfCoordinates As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfCoordinates {
	int get ();
}
```

# See Also
PolyLine Class
Autodesk.Revit.DB Namespace